function P= SR25A(x, q)
    %% 杆长参数
    model_param = [0.185; 0.6; 0.2; 0.65; 0.105]; 

    %% 6轴坐标系转换法栏坐标系
    trans_to_tool=[1,0,0,0;0,1,0,0;0,0,1,0;0,0,0,1];
    %% 误差参数占位
    abs_err = [ 0,0,0,0,0,0,...
                0,0,0,0,0,0, ...
                0,0,0,0,0,0, ...
                0,0,0,0,0,0, ...
                0,0,0,0,0,0, ...
                0,0,0,0,0,0];    
     abs_err = abs_err';
     
     P= T12B_14(x, q(1,1),q(2,1),q(3,1),q(4,1),q(5,1),q(6,1),model_param, abs_err, trans_to_tool);       
end